// let a = 50;
// let b = 30;
// let c = a / b;
//
// console.log("Result: " + c);
// console.log("Rounded: " + Math.round(c));
// console.log("PI:" + Math.PI);
// // console.log("LOG: " + Math.log(4));
// console.log("Min: " + Math.min(1,234,-1,234,643,12456,62));
// console.log("Max: " + Math.max(1,234,-1,234,643,12456,62));
// console.log("POW: " + Math.pow(2,3));

// https://regex101.com/





// . - будь який символ
// [Aa] - проміжок - тобто [a-d] === [abcd]
// $ - кінець строки
// \ - екранування (\.$)
// ^ - початок нової строки
// \d - те саме що [0-9]
// \D - виділяє успе окрім цифр, але бере до уваги пробіли
// m\s - знайде слова які закінчуються на m
// \S - усе окрім пробілу
// \w - будь яка буква
// \W - бере усе крім букв та цифр (Тобто крапки та пробіли)
// \b - виділяє границі слова (Наприклад щоб знайти всі слова в який 3 букви \b\w\w\w\b)
// \b\w{3}\b - що слово буде містити 3 букви
// Пошукати додатково за регулярки
//
// 4444-2343 2344 2344
//
// \d{4}(\s|-)\d{4}

// Группування
// +38 (050)
// ^\+38\s\(\d{3}\)